package errors

// 错误码 5000开始
const (
	ERRCODE_5000 = "5000" //封号中，请联系客服
	ERRCODE_5001 = "5001" //你的速度太快了
	ERRCODE_5002 = "5002" //正在游戏中
	ERRCODE_5003 = "5003" //参数错误
	ERRCODE_5004 = "5004" // "ip被封请联系管理员!", err
	ERRCODE_5005 = "5005" //商户不合法
	ERRCODE_5006 = "5006" //Hash不能为空
	ERRCODE_5007 = "5007" //"订单重复"
	ERRCODE_5008 = "5008" //upay充值订单失败
	ERRCODE_5009 = "5009" //服务异常
	ERRCODE_5010 = "5010" //创建充值订单失败
	ERRCODE_5011 = "5011" //未查询到提现预处理订单
	ERRCODE_5012 = "5012" //提现失败预处理订单用户id错误
	ERRCODE_5013 = "5013" //提现失败,预处理订单更新失败
	ERRCODE_5014 = "5014" //找不到玩家数据
	ERRCODE_5015 = "5015" //创建提现订单失败
	ERRCODE_5016 = "5016" //提现预处理订单更新失败
	ERRCODE_5017 = "5017" //未设置密码
	ERRCODE_5018 = "5018" //密码错误
	ERRCODE_5019 = "5019" //金额不能小于0
	ERRCODE_5021 = "5021" //打码量不足,无法提现
	ERRCODE_5022 = "5022" //提现费率计算失败
	ERRCODE_5023 = "5023" //更新玩家金币失败
	ERRCODE_5024 = "5024" //tg钱包提现请求错误,请稍后再试
	ERRCODE_5025 = "5025" //创建订单失败
	ERRCODE_5026 = "5026" //请设置密码
	ERRCODE_5027 = "5027" //余额不足
	ERRCODE_5028 = "5028" //转账到tg钱包请求错误
	ERRCODE_5029 = "5029" //upay 创建提现订单失败
	ERRCODE_5030 = "5030" //tg钱包转账到游戏请求错误
	ERRCODE_5031 = "5031" //upay 创建充值订单失败
	ERRCODE_5032 = "5032" //tg钱包余额查询错误
	ERRCODE_5033 = "5033" //领取失败,没有此挡位奖励
	ERRCODE_5034 = "5034" //找不到用户数据
	ERRCODE_5035 = "5035" //jili游戏国家错误
	ERRCODE_5036 = "5036" //游戏维护中
	ERRCODE_5037 = "5037" //游戏停服中
	ERRCODE_5038 = "5038" //无效的用户标识
)
